import { ArtTag } from "@/art/type"
import { unique } from "@/util/unique"

export const medias: ArtTag[] = [
    "アニメ", "マンガ", "本", "映画", "ドラマ",
    "アーティスト", "Youtuber", "ポッドキャスト", "ゲーム",
    // "イラストレーター", "ボードゲーム",
]

export const genres: Record<(typeof medias)[number], string[]> = {
    "アニメ": [
        "アクション", "ロマンス", "コメディ",
        "ファンタジー", "SF", "ホラー", "ミステリー", "スリラー",
        "スポーツ", "冒険", "歴史", "時代劇", "魔法", "恋愛",
        "学園", "青春", "ギャグ", "バトル", "萌え", "音楽",
        "ダンス", "アイドル", "グルメ", "超能力", "ダーク",
        "サスペンス", "ノンフィクション", "ファッション", "ミュージカル",
    ],
    "マンガ": [
        "アクション", "ロマンス", "コメディ",
        "ファンタジー", "SF", "ホラー", "ミステリー", "スリラー",
        "スポーツ", "冒険", "歴史", "時代劇", "魔法", "恋愛",
        "学園", "青春", "ギャグ", "バトル", "萌え", "音楽",
        "ダンス", "アイドル", "グルメ", "超能力", "ダーク",
        "サスペンス", "ノンフィクション", "ファッション", "ミュージカル",
    ],
    "本": [
        "ロマンス", "コメディ",
        "ファンタジー", "SF", "ホラー", "ミステリー", "スリラー",
        "スポーツ", "冒険", "歴史", "時代劇", "魔法", "恋愛",
        "学園", "青春", "ギャグ", "バトル", "萌え", "音楽",
        "ダンス", "アイドル", "グルメ", "超能力", "ダーク",
        "サスペンス", "ノンフィクション", "ファッション", "ミュージカル",
    ],
    "映画": [
        "アクション", "ロマンス", "コメディ",
        "ファンタジー", "SF", "ホラー", "ミステリー", "スリラー",
        "スポーツ", "冒険", "歴史", "時代劇", "魔法", "恋愛",
        "学園", "青春", "ギャグ", "バトル", "萌え", "音楽",
        "ダンス", "アイドル", "グルメ", "超能力", "ダーク",
        "サスペンス", "ノンフィクション", "ファッション", "ミュージカル",
    ],
    "ドラマ": [
        "アクション", "ロマンス", "コメディ",
        "ファンタジー", "SF", "ホラー", "ミステリー", "スリラー",
        "スポーツ", "冒険", "歴史", "時代劇", "魔法", "恋愛",
        "学園", "青春", "ギャグ", "バトル", "萌え", "音楽",
        "ダンス", "アイドル", "グルメ", "超能力", "ダーク",
        "サスペンス", "ノンフィクション", "ファッション", "ミュージカル",
    ],
    "アーティスト": [
        "ロマンス",
        "ファンタジー", "ホラー", "ミステリアス",
        "スポーツ", "魔法", "恋愛",
        "萌え",
        "ダンス", "アイドル", "ダーク",
        "ミュージカル",
    ],
    "Youtuber": [
        "ロマンス",
        "ファンタジー", "ホラー", "ミステリアス",
        "スポーツ", "魔法", "恋愛",
        "萌え",
        "ダンス", "アイドル", "ダーク",
        "ミュージカル",
        "美容", "料理", "旅行", "Vlog",
    ],
    "ポッドキャスト": [
        "教養", "企業", "美容", "料理",
        "旅行", "Vlog",
    ],
    "ゲーム": [
        "アクション", "アドベンチャー", "RPG", "シューティング", "シミュレーション",
        "ホラー", "パズル", "レーシング", "スポーツ", "格闘",
        "音楽", "リズム", "MMORPG", "オープンワールド", "スマホゲーム",
        "PCゲーム", "バトルロイヤル", "ボードゲーム", "トレーディングカードゲーム", "ノベル",
        "アーケード", "VR", "AR",
    ],
    // "イラストレーター": [
    //     "アニメ",
    // ],
    // "ボードゲーム": [
    //     "",
    // ],
}
const allGenres: ArtTag[] = unique(Object.values(genres).flat())
export const getGenreTags = (medias: string[]) => {
    if (medias.length <= 0) return allGenres
    return unique(medias.map(media => genres[media] ?? []).flat())
}

export const others: ArtTag[] = [
    "感動", "クラシック", "インディーズ", "ヒット作", "定番",
    "ハイテク", "カラフル", "明るい", "暗い", "楽しい",
    "勉強になる",
]
